dockers/jmeter-scripts/jmeter.log
2023-08-11 14:43:30,955 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2023-08-11 14:43:30,978 INFO o.a.j.JMeter: Loading user properties from: D:\apache-jmeter-5.5\apache-jmeter-5.5\bin\user.properties
2023-08-11 14:43:30,980 INFO o.a.j.JMeter: Loading system properties from: D:\apache-jmeter-5.5\apache-jmeter-5.5\bin\system.properties
2023-08-11 14:43:30,986 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2023-08-11 14:43:30,986 INFO o.a.j.JMeter: Version 5.5
2023-08-11 14:43:30,987 INFO o.a.j.JMeter: java.version=18.0.2.1
2023-08-11 14:43:30,987 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2023-08-11 14:43:30,987 INFO o.a.j.JMeter: os.name=Windows 10
2023-08-11 14:43:30,987 INFO o.a.j.JMeter: os.arch=amd64
2023-08-11 14:43:30,987 INFO o.a.j.JMeter: os.version=10.0
2023-08-11 14:43:30,987 INFO o.a.j.JMeter: file.encoding=UTF-8
2023-08-11 14:43:30,987 INFO o.a.j.JMeter: java.awt.headless=true
2023-08-11 14:43:30,987 INFO o.a.j.JMeter: Max memory     =1073741824
2023-08-11 14:43:30,987 INFO o.a.j.JMeter: Available Processors =8
2023-08-11 14:43:30,995 INFO o.a.j.JMeter: Default Locale=English (EN)
2023-08-11 14:43:30,995 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2023-08-11 14:43:30,995 INFO o.a.j.JMeter: JMeterHome=D:\apache-jmeter-5.5\apache-jmeter-5.5
2023-08-11 14:43:30,995 INFO o.a.j.JMeter: user.dir  =D:\jmeterLab\dockers\jmeter-scripts
2023-08-11 14:43:30,996 INFO o.a.j.JMeter: PWD       =D:\jmeterLab\dockers\jmeter-scripts
2023-08-11 14:43:30,997 INFO o.a.j.JMeter: IP: 192.168.1.58 Name: CPFHP-CD2033M32 FullName: CPFHP-CD2033M32.cpf.co.th
2023-08-11 14:43:31,006 INFO o.a.j.s.FileServer: Default base='D:\jmeterLab\dockers\jmeter-scripts'
2023-08-11 14:43:31,006 INFO o.a.j.s.FileServer: Set new base='D:\jmeterLab\dockers\jmeter-scripts'
2023-08-11 14:43:31,185 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2023-08-11 14:43:31,212 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2023-08-11 14:43:31,215 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2023-08-11 14:43:31,215 WARN o.a.j.s.SaveService: Can't register a converter: com.ubikingenierie.jmeter.plugin.videostreaming.result.HTTPSampleResultManifestConverter
java.lang.ClassNotFoundException: com.ubikingenierie.jmeter.plugin.videostreaming.result.HTTPSampleResultManifestConverter
	at java.net.URLClassLoader.findClass(URLClassLoader.java:445) ~[?:?]
	at java.lang.ClassLoader.loadClass(ClassLoader.java:588) ~[?:?]
	at java.lang.ClassLoader.loadClass(ClassLoader.java:521) ~[?:?]
	at java.lang.Class.forName0(Native Method) ~[?:?]
	at java.lang.Class.forName(Class.java:383) ~[?:?]
	at java.lang.Class.forName(Class.java:376) ~[?:?]
	at org.apache.jmeter.save.SaveService.registerConverter(SaveService.java:280) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.save.SaveService.registerConverter(SaveService.java:256) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.save.SaveService.initProps(SaveService.java:242) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.save.SaveService.<clinit>(SaveService.java:161) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.JMeter.runNonGui(JMeter.java:931) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.JMeter.startNonGui(JMeter.java:917) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.JMeter.start(JMeter.java:485) ~[ApacheJMeter_core.jar:5.5]
	at jdk.internal.reflect.DirectMethodHandleAccessor.invoke(DirectMethodHandleAccessor.java:104) ~[?:?]
	at java.lang.reflect.Method.invoke(Method.java:577) ~[?:?]
	at org.apache.jmeter.NewDriver.main(NewDriver.java:259) ~[ApacheJMeter.jar:5.5]
2023-08-11 14:43:31,224 WARN o.a.j.s.SaveService: Can't register a converter: com.ubikingenierie.jmeter.plugin.videostreaming.result.VideoStreamingSampleResultConverter
java.lang.ClassNotFoundException: com.ubikingenierie.jmeter.plugin.videostreaming.result.VideoStreamingSampleResultConverter
	at java.net.URLClassLoader.findClass(URLClassLoader.java:445) ~[?:?]
	at java.lang.ClassLoader.loadClass(ClassLoader.java:588) ~[?:?]
	at java.lang.ClassLoader.loadClass(ClassLoader.java:521) ~[?:?]
	at java.lang.Class.forName0(Native Method) ~[?:?]
	at java.lang.Class.forName(Class.java:383) ~[?:?]
	at java.lang.Class.forName(Class.java:376) ~[?:?]
	at org.apache.jmeter.save.SaveService.registerConverter(SaveService.java:280) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.save.SaveService.registerConverter(SaveService.java:256) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.save.SaveService.initProps(SaveService.java:242) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.save.SaveService.<clinit>(SaveService.java:161) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.JMeter.runNonGui(JMeter.java:931) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.JMeter.startNonGui(JMeter.java:917) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.JMeter.start(JMeter.java:485) ~[ApacheJMeter_core.jar:5.5]
	at jdk.internal.reflect.DirectMethodHandleAccessor.invoke(DirectMethodHandleAccessor.java:104) ~[?:?]
	at java.lang.reflect.Method.invoke(Method.java:577) ~[?:?]
	at org.apache.jmeter.NewDriver.main(NewDriver.java:259) ~[ApacheJMeter.jar:5.5]
2023-08-11 14:43:31,225 WARN o.a.j.s.SaveService: Can't register a converter: com.ubikingenierie.jmeter.plugin.videostreaming.result.HTTPSampleResultChunkConverter
java.lang.ClassNotFoundException: com.ubikingenierie.jmeter.plugin.videostreaming.result.HTTPSampleResultChunkConverter
	at java.net.URLClassLoader.findClass(URLClassLoader.java:445) ~[?:?]
	at java.lang.ClassLoader.loadClass(ClassLoader.java:588) ~[?:?]
	at java.lang.ClassLoader.loadClass(ClassLoader.java:521) ~[?:?]
	at java.lang.Class.forName0(Native Method) ~[?:?]
	at java.lang.Class.forName(Class.java:383) ~[?:?]
	at java.lang.Class.forName(Class.java:376) ~[?:?]
	at org.apache.jmeter.save.SaveService.registerConverter(SaveService.java:280) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.save.SaveService.registerConverter(SaveService.java:256) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.save.SaveService.initProps(SaveService.java:242) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.save.SaveService.<clinit>(SaveService.java:161) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.JMeter.runNonGui(JMeter.java:931) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.JMeter.startNonGui(JMeter.java:917) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.JMeter.start(JMeter.java:485) ~[ApacheJMeter_core.jar:5.5]
	at jdk.internal.reflect.DirectMethodHandleAccessor.invoke(DirectMethodHandleAccessor.java:104) ~[?:?]
	at java.lang.reflect.Method.invoke(Method.java:577) ~[?:?]
	at org.apache.jmeter.NewDriver.main(NewDriver.java:259) ~[ApacheJMeter.jar:5.5]
2023-08-11 14:43:31,227 INFO o.a.j.s.SaveService: Loading file: test.jmx
2023-08-11 14:43:31,265 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-08-11 14:43:31,265 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-08-11 14:43:31,265 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-08-11 14:43:31,265 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-08-11 14:43:31,265 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2023-08-11 14:43:31,265 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2023-08-11 14:43:31,269 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2023-08-11 14:43:31,269 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2023-08-11 14:43:31,269 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2023-08-11 14:43:31,269 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2023-08-11 14:43:31,292 INFO o.a.j.JMeter: Creating summariser <summary>
2023-08-11 14:43:31,303 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2023-08-11 14:43:31,303 INFO o.a.j.s.SampleEvent: List of sample_variables: [ulp_buffer_fill, ulp_lag_time, ulp_play_time, ulp_lag_ratio, ulp_lag_ratio_wo_bf, ulp_dwn_time, ulp_speed_rate, ulp_actual_live_offset]
2023-08-11 14:43:31,304 INFO o.a.j.s.SampleEvent: List of sample_variables: [ulp_buffer_fill, ulp_lag_time, ulp_play_time, ulp_lag_ratio, ulp_lag_ratio_wo_bf, ulp_dwn_time, ulp_speed_rate, ulp_actual_live_offset]
2023-08-11 14:43:31,308 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2023-08-11 14:43:31,308 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2023-08-11 14:43:31,407 INFO o.a.j.v.b.BackendListener: Backend Listener: Starting worker with class: class io.github.mderevyankoaqa.influxdb2.visualizer.InfluxDatabaseBackendListenerClient and queue capacity: 5000
2023-08-11 14:43:31,408 INFO o.a.j.v.b.BackendListener: Backend Listener: Started  worker with class: class io.github.mderevyankoaqa.influxdb2.visualizer.InfluxDatabaseBackendListenerClient
2023-08-11 14:43:31,413 INFO i.g.m.i.v.InfluxDatabaseBackendListenerClient: New instance of InfluxDatabaseClient has been created!
2023-08-11 14:43:31,413 INFO i.g.m.i.v.InfluxDatabaseBackendListenerClient: InfluxDBClientFactory is going to use the following properties:
2023-08-11 14:43:31,413 INFO i.g.m.i.v.InfluxDatabaseBackendListenerClient: URL --> http://localhost:8086/
2023-08-11 14:43:31,413 INFO i.g.m.i.v.InfluxDatabaseBackendListenerClient: Token --> h4OM94Jv8FXsMkWsAGS3HVauMdHgNjNLgfzJzAGz4FUmqEHwxpJWXB1iDvnECiLg3ySwdGzFHfRqykNGpGxZDg==
2023-08-11 14:43:31,413 INFO i.g.m.i.v.InfluxDatabaseBackendListenerClient: Organization --> nonfunc_org
2023-08-11 14:43:31,413 INFO i.g.m.i.v.InfluxDatabaseBackendListenerClient: Bucket --> nonfunc_bucket
2023-08-11 14:43:31,793 INFO o.a.j.JMeter: Running test (1691739811793)
2023-08-11 14:43:31,809 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2023-08-11 14:43:31,809 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Thread Group.
2023-08-11 14:43:31,809 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2023-08-11 14:43:31,809 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2023-08-11 14:43:31,813 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2023-08-11 14:43:31,813 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2023-08-11 14:43:31,816 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2023-08-11 14:43:31,830 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = CPFHP-CD2033M32
2023-08-11 14:43:31,834 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2023-08-11 14:43:31,922 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2023-08-11 14:43:31,927 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2023-08-11 14:43:31,927 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2023-08-11 14:43:31,945 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2023-08-11 14:43:31,946 INFO o.a.j.u.SSLManager: KeyStore created OK
2023-08-11 14:43:31,946 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2023-08-11 14:43:32,169 INFO o.a.j.r.Summariser: summary +      1 in 00:00:00 =    2.7/s Avg:   259 Min:   259 Max:   259 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2023-08-11 14:43:32,169 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2023-08-11 14:43:32,170 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2023-08-11 14:43:32,173 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2023-08-11 14:43:32,185 INFO o.a.j.v.b.BackendListener: Worker ended
2023-08-11 14:43:32,185 INFO i.g.m.i.v.InfluxDatabaseBackendListenerClient: Shutting down influxDB scheduler...
2023-08-11 14:43:32,186 INFO i.g.m.i.v.InfluxDatabaseBackendListenerClient: influxDB scheduler terminated!
2023-08-11 14:43:32,186 INFO i.g.m.i.v.InfluxDatabaseBackendListenerClient: The final step ---> importing before closing.
2023-08-11 14:43:32,326 INFO i.g.m.i.v.InfluxDatabaseBackendListenerClient: Data has been imported successfully, batch with size is --> 4, elapsed time is --> 137 ms
2023-08-11 14:43:32,328 INFO i.g.m.i.v.InfluxDatabaseBackendListenerClient: Instance of InfluxDatabaseClient has been refreshed!
2023-08-11 14:43:32,336 INFO o.a.j.r.Summariser: summary =      1 in 00:00:01 =    1.8/s Avg:   259 Min:   259 Max:   259 Err:     0 (0.00%)